; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v7 ?v2)
             (pred_8 ?v3 ?v12)
             (pred_10 ?v7 ?v12)
             (pred_4 ?v8 ?v7 )
	     (pred_1 ?v7)
             (pred_6 ?v10)
             (pred_9 ?v3)
             (pred_3 ?v12)
             (pred_12 ?v7)
             (pred_5 ?v3)
             (pred_2 ?v7)
             (pred_11 ))



(:action op_3
:parameters (?v5 ?v11 ?v1 ?v4)
:precondition (and (pred_6 ?v5) (pred_6 ?v11) (pred_9 ?v1) (pred_3 ?v4)
          (pred_7 ?v5 ?v11) (pred_8 ?v1 ?v4)
                   (pred_10 ?v11 ?v4) (pred_1 ?v5) 
                   (pred_12 ?v11) (pred_5 ?v1))
:effect (and  (pred_2 ?v11) (not (pred_12 ?v11))))


(:action op_1
:parameters (?v5 ?v13)
:precondition (and (pred_6 ?v5) (pred_6 ?v13)
               (pred_1 ?v5) (pred_7 ?v5 ?v13) (pred_2 ?v13))
:effect (and (pred_1 ?v13) (not (pred_1 ?v5))))

(:action op_5
:parameters (?v5 ?v1)
:precondition (and (pred_6 ?v5) (pred_9 ?v1) 
                  (pred_1 ?v5) (pred_4 ?v1 ?v5) (pred_11 ))
:effect (and (pred_5 ?v1)
   (not (pred_4 ?v1 ?v5)) (not (pred_11 ))))


(:action op_2
:parameters (?v5 ?v6 ?v9)
:precondition (and (pred_6 ?v5) (pred_9 ?v6) (pred_9 ?v9)
                  (pred_1 ?v5) (pred_5 ?v9) (pred_4 ?v6 ?v5))
:effect (and (pred_5 ?v6) (pred_4 ?v9 ?v5)
        (not (pred_5 ?v9)) (not (pred_4 ?v6 ?v5))))

(:action op_4
:parameters (?v5 ?v1)
:precondition (and (pred_6 ?v5) (pred_9 ?v1) 
                  (pred_1 ?v5) (pred_5 ?v1))
:effect (and (pred_11 ) (pred_4 ?v1 ?v5) (not (pred_5 ?v1)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_29 obj_26 obj_19 obj_11 obj_30 obj_31 obj_06 obj_24 obj_02 obj_23 obj_28 obj_14 obj_03 obj_20 obj_21 obj_09 obj_15 obj_01 obj_16 obj_25 obj_05 obj_17 obj_13 obj_07 obj_22
    obj_27 obj_32 obj_10
    obj_04 obj_08 obj_18 obj_12
    )

    (:init
       (pred_11)

       (pred_6 obj_29)
       (pred_6 obj_26)
       (pred_6 obj_19)
       (pred_6 obj_11)
       (pred_6 obj_30)
       (pred_6 obj_31)
       (pred_6 obj_06)
       (pred_6 obj_24)
       (pred_6 obj_02)
       (pred_6 obj_23)
       (pred_6 obj_28)
       (pred_6 obj_14)
       (pred_6 obj_03)
       (pred_6 obj_20)
       (pred_6 obj_21)
       (pred_6 obj_09)
       (pred_6 obj_15)
       (pred_6 obj_01)
       (pred_6 obj_16)
       (pred_6 obj_25)
       (pred_6 obj_05)
       (pred_6 obj_17)
       (pred_6 obj_13)
       (pred_6 obj_07)
       (pred_6 obj_22)
       (pred_3 obj_27)
       (pred_3 obj_32)
       (pred_3 obj_10)
       (pred_9 obj_04)
       (pred_9 obj_08)
       (pred_9 obj_18)
       (pred_9 obj_12)

       (pred_7 obj_29 obj_31)
       (pred_7 obj_29 obj_26)
       (pred_7 obj_26 obj_06)
       (pred_7 obj_26 obj_19)
       (pred_7 obj_26 obj_29)
       (pred_7 obj_19 obj_24)
       (pred_7 obj_19 obj_11)
       (pred_7 obj_19 obj_26)
       (pred_7 obj_11 obj_02)
       (pred_7 obj_11 obj_30)
       (pred_7 obj_11 obj_19)
       (pred_7 obj_30 obj_23)
       (pred_7 obj_30 obj_11)
       (pred_7 obj_31 obj_28)
       (pred_7 obj_31 obj_06)
       (pred_7 obj_31 obj_29)
       (pred_7 obj_06 obj_14)
       (pred_7 obj_06 obj_24)
       (pred_7 obj_06 obj_26)
       (pred_7 obj_06 obj_31)
       (pred_7 obj_24 obj_03)
       (pred_7 obj_24 obj_02)
       (pred_7 obj_24 obj_19)
       (pred_7 obj_24 obj_06)
       (pred_7 obj_02 obj_20)
       (pred_7 obj_02 obj_23)
       (pred_7 obj_02 obj_11)
       (pred_7 obj_02 obj_24)
       (pred_7 obj_23 obj_21)
       (pred_7 obj_23 obj_30)
       (pred_7 obj_23 obj_02)
       (pred_7 obj_28 obj_09)
       (pred_7 obj_28 obj_14)
       (pred_7 obj_28 obj_31)
       (pred_7 obj_14 obj_15)
       (pred_7 obj_14 obj_03)
       (pred_7 obj_14 obj_06)
       (pred_7 obj_14 obj_28)
       (pred_7 obj_03 obj_01)
       (pred_7 obj_03 obj_20)
       (pred_7 obj_03 obj_24)
       (pred_7 obj_03 obj_14)
       (pred_7 obj_20 obj_16)
       (pred_7 obj_20 obj_21)
       (pred_7 obj_20 obj_02)
       (pred_7 obj_20 obj_03)
       (pred_7 obj_21 obj_25)
       (pred_7 obj_21 obj_23)
       (pred_7 obj_21 obj_20)
       (pred_7 obj_09 obj_05)
       (pred_7 obj_09 obj_15)
       (pred_7 obj_09 obj_28)
       (pred_7 obj_15 obj_17)
       (pred_7 obj_15 obj_01)
       (pred_7 obj_15 obj_14)
       (pred_7 obj_15 obj_09)
       (pred_7 obj_01 obj_13)
       (pred_7 obj_01 obj_16)
       (pred_7 obj_01 obj_03)
       (pred_7 obj_01 obj_15)
       (pred_7 obj_16 obj_07)
       (pred_7 obj_16 obj_25)
       (pred_7 obj_16 obj_20)
       (pred_7 obj_16 obj_01)
       (pred_7 obj_25 obj_22)
       (pred_7 obj_25 obj_21)
       (pred_7 obj_25 obj_16)
       (pred_7 obj_05 obj_17)
       (pred_7 obj_05 obj_09)
       (pred_7 obj_17 obj_13)
       (pred_7 obj_17 obj_15)
       (pred_7 obj_17 obj_05)
       (pred_7 obj_13 obj_07)
       (pred_7 obj_13 obj_01)
       (pred_7 obj_13 obj_17)
       (pred_7 obj_07 obj_22)
       (pred_7 obj_07 obj_16)
       (pred_7 obj_07 obj_13)
       (pred_7 obj_22 obj_25)
       (pred_7 obj_22 obj_07)
       (pred_12 obj_15)
       (pred_12 obj_06)
       (pred_12 obj_30)
       (pred_12 obj_16)
       (pred_10  obj_15 obj_27)
       (pred_10  obj_06 obj_32)
       (pred_10  obj_30 obj_10)
       (pred_10  obj_16 obj_10)
       (pred_2 obj_29)
       (pred_2 obj_26)
       (pred_2 obj_19)
       (pred_2 obj_11)
       (pred_2 obj_31)
       (pred_2 obj_24)
       (pred_2 obj_02)
       (pred_2 obj_23)
       (pred_2 obj_28)
       (pred_2 obj_14)
       (pred_2 obj_03)
       (pred_2 obj_20)
       (pred_2 obj_21)
       (pred_2 obj_09)
       (pred_2 obj_01)
       (pred_2 obj_25)
       (pred_2 obj_05)
       (pred_2 obj_17)
       (pred_2 obj_13)
       (pred_2 obj_07)
       (pred_2 obj_22)

       (pred_8  obj_04 obj_27)
       (pred_8  obj_08 obj_32)
       (pred_8  obj_18 obj_10)
       (pred_8  obj_12 obj_10)
       (pred_4 obj_04 obj_01)
       (pred_4 obj_08 obj_28)
       (pred_4 obj_18 obj_25)
       (pred_4 obj_12 obj_29)
       (pred_1 obj_14)
    )

    (:goal (and
       (pred_4 obj_04 obj_22)
       (pred_4 obj_12 obj_03)
    ))
(:constraints
  (always (not (pred_1 obj_19)))
)
)

; plan
1. (op_1 obj_14 obj_03)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_03)
   goals met: 0 of 2
2. (op_1 obj_03 obj_01)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_01)
   goals met: 0 of 2
3. (op_5 obj_01 obj_04)
   deleted: (pred_4 obj_04 obj_01) (pred_11)
   added: (pred_5 obj_04)
   goals met: 0 of 2
4. (op_1 obj_01 obj_03)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_03)
   goals met: 0 of 2
5. (op_1 obj_03 obj_14)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_14)
   goals met: 0 of 2
6. (op_1 obj_14 obj_28)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_28)
   goals met: 0 of 2
7. (op_1 obj_28 obj_31)
   deleted: (pred_1 obj_28)
   added: (pred_1 obj_31)
   goals met: 0 of 2
8. (op_1 obj_31 obj_29)
   deleted: (pred_1 obj_31)
   added: (pred_1 obj_29)
   goals met: 0 of 2
9. (op_2 obj_29 obj_12 obj_04)
   deleted: (pred_5 obj_04) (pred_4 obj_12 obj_29)
   added: (pred_5 obj_12) (pred_4 obj_04 obj_29)
   goals met: 0 of 2
10. (op_1 obj_29 obj_31)
   deleted: (pred_1 obj_29)
   added: (pred_1 obj_31)
   goals met: 0 of 2
11. (op_1 obj_31 obj_28)
   deleted: (pred_1 obj_31)
   added: (pred_1 obj_28)
   goals met: 0 of 2
12. (op_1 obj_28 obj_14)
   deleted: (pred_1 obj_28)
   added: (pred_1 obj_14)
   goals met: 0 of 2
13. (op_1 obj_14 obj_03)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_03)
   goals met: 0 of 2
14. (op_4 obj_03 obj_12)
   deleted: (pred_5 obj_12)
   added: (pred_11) (pred_4 obj_12 obj_03)
   goals met: 1 of 2
15. (op_1 obj_03 obj_14)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_14)
   goals met: 1 of 2
16. (op_1 obj_14 obj_28)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_28)
   goals met: 1 of 2
17. (op_1 obj_28 obj_31)
   deleted: (pred_1 obj_28)
   added: (pred_1 obj_31)
   goals met: 1 of 2
18. (op_1 obj_31 obj_29)
   deleted: (pred_1 obj_31)
   added: (pred_1 obj_29)
   goals met: 1 of 2
19. (op_5 obj_29 obj_04)
   deleted: (pred_4 obj_04 obj_29) (pred_11)
   added: (pred_5 obj_04)
   goals met: 1 of 2
20. (op_1 obj_29 obj_31)
   deleted: (pred_1 obj_29)
   added: (pred_1 obj_31)
   goals met: 1 of 2
21. (op_1 obj_31 obj_28)
   deleted: (pred_1 obj_31)
   added: (pred_1 obj_28)
   goals met: 1 of 2
22. (op_1 obj_28 obj_14)
   deleted: (pred_1 obj_28)
   added: (pred_1 obj_14)
   goals met: 1 of 2
23. (op_1 obj_14 obj_03)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_03)
   goals met: 1 of 2
24. (op_1 obj_03 obj_20)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_20)
   goals met: 1 of 2
25. (op_1 obj_20 obj_21)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_21)
   goals met: 1 of 2
26. (op_1 obj_21 obj_25)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_25)
   goals met: 1 of 2
27. (op_1 obj_25 obj_22)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_22)
   goals met: 1 of 2
28. (op_4 obj_22 obj_04)
   deleted: (pred_5 obj_04)
   added: (pred_11) (pred_4 obj_04 obj_22)
   goals met: 2 of 2
